RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_DATA register.
//
//*****************************************************************************
#define GPIO_DATA_DATA_M        0x000000FF  // Input and output data 
#define GPIO_DATA_DATA_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_DIR register.
//
//*****************************************************************************
#define GPIO_DIR_DIR_M          0x000000FF  // Bits set: Corresponding pin is 
                                            // output Bits cleared: 
                                            // Corresponding pin is input 
#define GPIO_DIR_DIR_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_IS register.
//
//*****************************************************************************
#define GPIO_IS_IS_M            0x000000FF  // Bits set: Level on 
                                            // corresponding pin is detected 
                                            // Bits cleared: Edge on 
                                            // corresponding pin is detected 
#define GPIO_IS_IS_S            0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_IBE register.
//
//*****************************************************************************
#define GPIO_IBE_IBE_M          0x000000FF  // Bits set: Both edges on 
                                            // corresponding pin trigger an 
                                            // interrupt Bits cleared: 
                                            // Interrupt generation event is 
                                            // controlled by GPIOIEV Single 
                                            // edge: Determined by 
                                            // corresponding bit in GPIOIEV 
                                            // register 
#define GPIO_IBE_IBE_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_IEV register.
//
//*****************************************************************************
#define GPIO_IEV_IEV_M          0x000000FF  // Bits set: Rising edges or high 
                                            // levels on corresponding pin 
                                            // trigger interrupts Bits cleared: 
                                            // Falling edges or low levels on 
                                            // corresponding pin trigger 
                                            // interrupts 
#define GPIO_IEV_IEV_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_IE register.
//
//*****************************************************************************
#define GPIO_IE_IE_M            0x000000FF  // Bits set: Corresponding pin is 
                                            // not masked Bits cleared: 
                                            // Corresponding pin is masked 
#define GPIO_IE_IE_S            0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_RIS register.
//
//*****************************************************************************
#define GPIO_RIS_RIS_M          0x000000FF  // Reflects the status of 
                                            // interrupts trigger conditions 
                                            // detected on pins (raw, before 
                                            // masking) Bits set: Requirements 
                                            // met by corresponding pins Bits 
                                            // clear: Requirements not met 
#define GPIO_RIS_RIS_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_MIS register.
//
//*****************************************************************************
#define GPIO_MIS_MIS_M          0x000000FF  // Masked value of interrupt due 
                                            // to corresponding pin Bits clear: 
                                            // GPIO line interrupt not active 
                                            // Bits set: GPIO line asserting 
                                            // interrupt 
#define GPIO_MIS_MIS_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_IC register.
//
//*****************************************************************************
#define GPIO_IC_IC_M            0x000000FF  // Bit written as 1: Clears edge 
                                            // detection logic Bit written as 
                                            // 0: Has no effect 
#define GPIO_IC_IC_S            0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_AFSEL register.
//
//*****************************************************************************
#define GPIO_AFSEL_AFSEL_M      0x000000FF  // Bit set: Enables hardware 
                                            // (peripheral) control mode Bit 
                                            // cleared: Enables software 
                                            // control mode 
#define GPIO_AFSEL_AFSEL_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPIO_O_GPIOLOCK register.
//
//*****************************************************************************
#define GPIO_GPIOLOCK_LOCK_M    0xFFFFFFFF  // A read of this register returns 
                                            // the following values: Locked: 
                                            // 0x00000001 Unlocked: 0x00000000 
#define GPIO_GPIOLOCK_LOCK_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_GPIOCR register.
//
//*****************************************************************************
#define GPIO_GPIOCR_CR_M        0x000000FF  // On a bit-wise basis, any bit 
                                            // set allows the corresponding 
                                            // GPIOAFSEL bit to be set to its 
                                            // alternate function. 
#define GPIO_GPIOCR_CR_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PMUX register.
//
//*****************************************************************************
#define GPIO_PMUX_CKOEN         0x00000080  // Clock out enable When this bit 
                                            // is set, the 32-kHz clock is 
                                            // routed to either PA[0] or PB[7] 
                                            // pins. PMUX.CKOPIN selects the 
                                            // pin to use. This overrides the 
                                            // current configuration setting 
                                            // for this pin. The pullup or 
                                            // pulldown is disabled and the 
                                            // direction is set to output for 
                                            // this pin. 
#define GPIO_PMUX_CKOEN_M       0x00000080
#define GPIO_PMUX_CKOEN_S       7
#define GPIO_PMUX_CKOPIN        0x00000010  // Decouple control pin select 
                                            // This control only has relevance 
                                            // when CKOEN is set. When 0, PA[0] 
                                            // becomes the 32-kHz clock output. 
                                            // When 1, PB[7] becomes the 32-kHz 
                                            // clock output. 
#define GPIO_PMUX_CKOPIN_M      0x00000010
#define GPIO_PMUX_CKOPIN_S      4
#define GPIO_PMUX_DCEN          0x00000008  // Decouple control enable When 
                                            // this bit is set, the on-die 
                                            // digital regulator status is 
                                            // routed to either PB[1] or PB[0] 
                                            // pins. PMUX.DCPIN selects the pin 
                                            // to use. This overrides the 
                                            // current configuration setting 
                                            // for this pin. The pullup or 
                                            // pulldown is disabled and the 
                                            // direction is set to output for 
                                            // this pin. 
#define GPIO_PMUX_DCEN_M        0x00000008
#define GPIO_PMUX_DCEN_S        3
#define GPIO_PMUX_DCPIN         0x00000001  // Decouple control pin select 
                                            // This control has relevance only 
                                            // when DCEN is set. When 0, PB[1] 
                                            // becomes the on-die digital 
                                            // regulator status (1 indicates 
                                            // the on-die digital regulator is 
                                            // active); when 1, PB[0] becomes 
                                            // the on-die digital regulator 
                                            // status. NOTE: PB[1] and PB[0] 
                                            // can also be controlled with 
                                            // other override features. In 
                                            // priority order for PB[1]: When 
                                            // POR/BOD test mode is active, 
                                            // PB[1] becomes the active low 
                                            // brown-out detected indicator. 
                                            // When DCEN is set and DCPIN is 
                                            // not set, PB[1] becomes the 
                                            // on-dir digital regulator status. 
                                            // In priority order for PB[0]: 
                                            // When POR/BOD test mode is 
                                            // active, PB[0] becomes the 
                                            // power-on-reset indicator. When 
                                            // DCEN and DCPIN are set, PB[0] 
                                            // becomes the on-die digital 
                                            // regulator status. 
#define GPIO_PMUX_DCPIN_M       0x00000001
#define GPIO_PMUX_DCPIN_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPIO_O_P_EDGE_CTRL register.
//
//*****************************************************************************
#define GPIO_P_EDGE_CTRL_PDIRC7 0x80000000  // Port D bit 7 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PDIRC7_M \
                                0x80000000
#define GPIO_P_EDGE_CTRL_PDIRC7_S 31
#define GPIO_P_EDGE_CTRL_PDIRC6 0x40000000  // Port D bit 6 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PDIRC6_M \
                                0x40000000
#define GPIO_P_EDGE_CTRL_PDIRC6_S 30
#define GPIO_P_EDGE_CTRL_PDIRC5 0x20000000  // Port D bit 5 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PDIRC5_M \
                                0x20000000
#define GPIO_P_EDGE_CTRL_PDIRC5_S 29
#define GPIO_P_EDGE_CTRL_PDIRC4 0x10000000  // Port D bit 4 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PDIRC4_M \
                                0x10000000
#define GPIO_P_EDGE_CTRL_PDIRC4_S 28
#define GPIO_P_EDGE_CTRL_PDIRC3 0x08000000  // Port D bit 3 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PDIRC3_M \
                                0x08000000
#define GPIO_P_EDGE_CTRL_PDIRC3_S 27
#define GPIO_P_EDGE_CTRL_PDIRC2 0x04000000  // Port D bit 2 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PDIRC2_M \
                                0x04000000
#define GPIO_P_EDGE_CTRL_PDIRC2_S 26
#define GPIO_P_EDGE_CTRL_PDIRC1 0x02000000  // Port D bit 1 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PDIRC1_M \
                                0x02000000
#define GPIO_P_EDGE_CTRL_PDIRC1_S 25
#define GPIO_P_EDGE_CTRL_PDIRC0 0x01000000  // Port D bit 0 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PDIRC0_M \
                                0x01000000
#define GPIO_P_EDGE_CTRL_PDIRC0_S 24
#define GPIO_P_EDGE_CTRL_PCIRC7 0x00800000  // Port C bit 7 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PCIRC7_M \
                                0x00800000
#define GPIO_P_EDGE_CTRL_PCIRC7_S 23
#define GPIO_P_EDGE_CTRL_PCIRC6 0x00400000  // Port C bit 6 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PCIRC6_M \
                                0x00400000
#define GPIO_P_EDGE_CTRL_PCIRC6_S 22
#define GPIO_P_EDGE_CTRL_PCIRC5 0x00200000  // Port C bit 5 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PCIRC5_M \
                                0x00200000
#define GPIO_P_EDGE_CTRL_PCIRC5_S 21
#define GPIO_P_EDGE_CTRL_PCIRC4 0x00100000  // Port C bit 4 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PCIRC4_M \
                                0x00100000
#define GPIO_P_EDGE_CTRL_PCIRC4_S 20
#define GPIO_P_EDGE_CTRL_PCIRC3 0x00080000  // Port C bit 3 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PCIRC3_M \
                                0x00080000
#define GPIO_P_EDGE_CTRL_PCIRC3_S 19
#define GPIO_P_EDGE_CTRL_PCIRC2 0x00040000  // Port C bit 2 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PCIRC2_M \
                                0x00040000
#define GPIO_P_EDGE_CTRL_PCIRC2_S 18
#define GPIO_P_EDGE_CTRL_PCIRC1 0x00020000  // Port C bit 1 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PCIRC1_M \
                                0x00020000
#define GPIO_P_EDGE_CTRL_PCIRC1_S 17
#define GPIO_P_EDGE_CTRL_PCIRC0 0x00010000  // Port C bit 0 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PCIRC0_M \
                                0x00010000
#define GPIO_P_EDGE_CTRL_PCIRC0_S 16
#define GPIO_P_EDGE_CTRL_PBIRC7 0x00008000  // Port B bit 7 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PBIRC7_M \
                                0x00008000
#define GPIO_P_EDGE_CTRL_PBIRC7_S 15
#define GPIO_P_EDGE_CTRL_PBIRC6 0x00004000  // Port B bit 6 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PBIRC6_M \
                                0x00004000
#define GPIO_P_EDGE_CTRL_PBIRC6_S 14
#define GPIO_P_EDGE_CTRL_PBIRC5 0x00002000  // Port B bit 5 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PBIRC5_M \
                                0x00002000
#define GPIO_P_EDGE_CTRL_PBIRC5_S 13
#define GPIO_P_EDGE_CTRL_PBIRC4 0x00001000  // Port B bit 4 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PBIRC4_M \
                                0x00001000
#define GPIO_P_EDGE_CTRL_PBIRC4_S 12
#define GPIO_P_EDGE_CTRL_PBIRC3 0x00000800  // Port B bit 3 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PBIRC3_M \
                                0x00000800
#define GPIO_P_EDGE_CTRL_PBIRC3_S 11
#define GPIO_P_EDGE_CTRL_PBIRC2 0x00000400  // Port B bit 2 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PBIRC2_M \
                                0x00000400
#define GPIO_P_EDGE_CTRL_PBIRC2_S 10
#define GPIO_P_EDGE_CTRL_PBIRC1 0x00000200  // Port B bit 1 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PBIRC1_M \
                                0x00000200
#define GPIO_P_EDGE_CTRL_PBIRC1_S 9
#define GPIO_P_EDGE_CTRL_PBIRC0 0x00000100  // Port B bit 0 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PBIRC0_M \
                                0x00000100
#define GPIO_P_EDGE_CTRL_PBIRC0_S 8
#define GPIO_P_EDGE_CTRL_PAIRC7 0x00000080  // Port A bit 7 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PAIRC7_M \
                                0x00000080
#define GPIO_P_EDGE_CTRL_PAIRC7_S 7
#define GPIO_P_EDGE_CTRL_PAIRC6 0x00000040  // Port A bit 6 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PAIRC6_M \
                                0x00000040
#define GPIO_P_EDGE_CTRL_PAIRC6_S 6
#define GPIO_P_EDGE_CTRL_PAIRC5 0x00000020  // Port A bit 5 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PAIRC5_M \
                                0x00000020
#define GPIO_P_EDGE_CTRL_PAIRC5_S 5
#define GPIO_P_EDGE_CTRL_PAIRC4 0x00000010  // Port A bit 4 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PAIRC4_M \
                                0x00000010
#define GPIO_P_EDGE_CTRL_PAIRC4_S 4
#define GPIO_P_EDGE_CTRL_PAIRC3 0x00000008  // Port A bit 3 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PAIRC3_M \
                                0x00000008
#define GPIO_P_EDGE_CTRL_PAIRC3_S 3
#define GPIO_P_EDGE_CTRL_PAIRC2 0x00000004  // Port A bit 2 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PAIRC2_M \
                                0x00000004
#define GPIO_P_EDGE_CTRL_PAIRC2_S 2
#define GPIO_P_EDGE_CTRL_PAIRC1 0x00000002  // Port A bit 1 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PAIRC1_M \
                                0x00000002
#define GPIO_P_EDGE_CTRL_PAIRC1_S 1
#define GPIO_P_EDGE_CTRL_PAIRC0 0x00000001  // Port A bit 0 interrupt request 
                                            // condition: 0: Rising 1: Falling 
                                            // edge 
#define GPIO_P_EDGE_CTRL_PAIRC0_M \
                                0x00000001
#define GPIO_P_EDGE_CTRL_PAIRC0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPIO_O_USB_CTRL register.
//
//*****************************************************************************
#define GPIO_USB_CTRL_USB_EDGE_CTL \
                                0x00000001  // Used to set the edge which 
                                            // triggers the USB power up 
                                            // interrupt 0: Rising 1: Falling 

