RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_gpio.h
#define GPIO_USB_CTRL_USB_EDGE_CTL_M \
                                0x00000001
#define GPIO_USB_CTRL_USB_EDGE_CTL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PI_IEN register.
//
//*****************************************************************************
#define GPIO_PI_IEN_PDIEN7      0x80000000  // Port D bit 7 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PDIEN7_M    0x80000000
#define GPIO_PI_IEN_PDIEN7_S    31
#define GPIO_PI_IEN_PDIEN6      0x40000000  // Port D bit 6 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PDIEN6_M    0x40000000
#define GPIO_PI_IEN_PDIEN6_S    30
#define GPIO_PI_IEN_PDIEN5      0x20000000  // Port D bit 5 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PDIEN5_M    0x20000000
#define GPIO_PI_IEN_PDIEN5_S    29
#define GPIO_PI_IEN_PDIEN4      0x10000000  // Port D bit 4 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PDIEN4_M    0x10000000
#define GPIO_PI_IEN_PDIEN4_S    28
#define GPIO_PI_IEN_PDIEN3      0x08000000  // Port D bit 3 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PDIEN3_M    0x08000000
#define GPIO_PI_IEN_PDIEN3_S    27
#define GPIO_PI_IEN_PDIEN2      0x04000000  // Port D bit 2 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PDIEN2_M    0x04000000
#define GPIO_PI_IEN_PDIEN2_S    26
#define GPIO_PI_IEN_PDIEN1      0x02000000  // Port D bit 1 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PDIEN1_M    0x02000000
#define GPIO_PI_IEN_PDIEN1_S    25
#define GPIO_PI_IEN_PDIEN0      0x01000000  // Port D bit 0 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PDIEN0_M    0x01000000
#define GPIO_PI_IEN_PDIEN0_S    24
#define GPIO_PI_IEN_PCIEN7      0x00800000  // Port C bit 7 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PCIEN7_M    0x00800000
#define GPIO_PI_IEN_PCIEN7_S    23
#define GPIO_PI_IEN_PCIEN6      0x00400000  // Port C bit 6 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PCIEN6_M    0x00400000
#define GPIO_PI_IEN_PCIEN6_S    22
#define GPIO_PI_IEN_PCIEN5      0x00200000  // Port C bit 5 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PCIEN5_M    0x00200000
#define GPIO_PI_IEN_PCIEN5_S    21
#define GPIO_PI_IEN_PCIEN4      0x00100000  // Port C bit 4 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PCIEN4_M    0x00100000
#define GPIO_PI_IEN_PCIEN4_S    20
#define GPIO_PI_IEN_PCIEN3      0x00080000  // Port C bit 3 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PCIEN3_M    0x00080000
#define GPIO_PI_IEN_PCIEN3_S    19
#define GPIO_PI_IEN_PCIEN2      0x00040000  // Port C bit 2 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PCIEN2_M    0x00040000
#define GPIO_PI_IEN_PCIEN2_S    18
#define GPIO_PI_IEN_PCIEN1      0x00020000  // Port C bit 1 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PCIEN1_M    0x00020000
#define GPIO_PI_IEN_PCIEN1_S    17
#define GPIO_PI_IEN_PCIEN0      0x00010000  // Port C bit 0 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PCIEN0_M    0x00010000
#define GPIO_PI_IEN_PCIEN0_S    16
#define GPIO_PI_IEN_PBIEN7      0x00008000  // Port B bit 7 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PBIEN7_M    0x00008000
#define GPIO_PI_IEN_PBIEN7_S    15
#define GPIO_PI_IEN_PBIEN6      0x00004000  // Port B bit 6 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PBIEN6_M    0x00004000
#define GPIO_PI_IEN_PBIEN6_S    14
#define GPIO_PI_IEN_PBIEN5      0x00002000  // Port B bit 5 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PBIEN5_M    0x00002000
#define GPIO_PI_IEN_PBIEN5_S    13
#define GPIO_PI_IEN_PBIEN4      0x00001000  // Port B bit 4 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PBIEN4_M    0x00001000
#define GPIO_PI_IEN_PBIEN4_S    12
#define GPIO_PI_IEN_PBIEN3      0x00000800  // Port B bit 3 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PBIEN3_M    0x00000800
#define GPIO_PI_IEN_PBIEN3_S    11
#define GPIO_PI_IEN_PBIEN2      0x00000400  // Port B bit 2 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PBIEN2_M    0x00000400
#define GPIO_PI_IEN_PBIEN2_S    10
#define GPIO_PI_IEN_PBIEN1      0x00000200  // Port B bit 1 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PBIEN1_M    0x00000200
#define GPIO_PI_IEN_PBIEN1_S    9
#define GPIO_PI_IEN_PBIEN0      0x00000100  // Port B bit 0 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PBIEN0_M    0x00000100
#define GPIO_PI_IEN_PBIEN0_S    8
#define GPIO_PI_IEN_PAIEN7      0x00000080  // Port A bit 7 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PAIEN7_M    0x00000080
#define GPIO_PI_IEN_PAIEN7_S    7
#define GPIO_PI_IEN_PAIEN6      0x00000040  // Port A bit 6 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PAIEN6_M    0x00000040
#define GPIO_PI_IEN_PAIEN6_S    6
#define GPIO_PI_IEN_PAIEN5      0x00000020  // Port A bit 5 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PAIEN5_M    0x00000020
#define GPIO_PI_IEN_PAIEN5_S    5
#define GPIO_PI_IEN_PAIEN4      0x00000010  // Port A bit 4 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PAIEN4_M    0x00000010
#define GPIO_PI_IEN_PAIEN4_S    4
#define GPIO_PI_IEN_PAIEN3      0x00000008  // Port A bit 3 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PAIEN3_M    0x00000008
#define GPIO_PI_IEN_PAIEN3_S    3
#define GPIO_PI_IEN_PAIEN2      0x00000004  // Port A bit 2 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PAIEN2_M    0x00000004
#define GPIO_PI_IEN_PAIEN2_S    2
#define GPIO_PI_IEN_PAIEN1      0x00000002  // Port A bit 1 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PAIEN1_M    0x00000002
#define GPIO_PI_IEN_PAIEN1_S    1
#define GPIO_PI_IEN_PAIEN0      0x00000001  // Port A bit 0 interrupt enable: 
                                            // 1: Enabled 2: Disabled 
#define GPIO_PI_IEN_PAIEN0_M    0x00000001
#define GPIO_PI_IEN_PAIEN0_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPIO_O_IRQ_DETECT_ACK register.
//
//*****************************************************************************
#define GPIO_IRQ_DETECT_ACK_PDIACK7 \
                                0x80000000  // Port D bit 7 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PDIACK7_M \
                                0x80000000
#define GPIO_IRQ_DETECT_ACK_PDIACK7_S 31
#define GPIO_IRQ_DETECT_ACK_PDIACK6 \
                                0x40000000  // Port D bit 6 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PDIACK6_M \
                                0x40000000
#define GPIO_IRQ_DETECT_ACK_PDIACK6_S 30
#define GPIO_IRQ_DETECT_ACK_PDIACK5 \
                                0x20000000  // Port D bit 5 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PDIACK5_M \
                                0x20000000
#define GPIO_IRQ_DETECT_ACK_PDIACK5_S 29
#define GPIO_IRQ_DETECT_ACK_PDIACK4 \
                                0x10000000  // Port D bit 4 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PDIACK4_M \
                                0x10000000
#define GPIO_IRQ_DETECT_ACK_PDIACK4_S 28
#define GPIO_IRQ_DETECT_ACK_PDIACK3 \
                                0x08000000  // Port D bit 3 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PDIACK3_M \
                                0x08000000
#define GPIO_IRQ_DETECT_ACK_PDIACK3_S 27
#define GPIO_IRQ_DETECT_ACK_PDIACK2 \
                                0x04000000  // Port D bit 2 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PDIACK2_M \
                                0x04000000
#define GPIO_IRQ_DETECT_ACK_PDIACK2_S 26
#define GPIO_IRQ_DETECT_ACK_PDIACK1 \
                                0x02000000  // Port D bit 1 masked interrupt 
                                            // status: 1: Detected0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PDIACK1_M \
                                0x02000000
#define GPIO_IRQ_DETECT_ACK_PDIACK1_S 25
#define GPIO_IRQ_DETECT_ACK_PDIACK0 \
                                0x01000000  // Port D bit 0 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PDIACK0_M \
                                0x01000000
#define GPIO_IRQ_DETECT_ACK_PDIACK0_S 24
#define GPIO_IRQ_DETECT_ACK_PCIACK7 \
                                0x00800000  // Port C bit 7 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PCIACK7_M \
                                0x00800000
#define GPIO_IRQ_DETECT_ACK_PCIACK7_S 23
#define GPIO_IRQ_DETECT_ACK_PCIACK6 \
                                0x00400000  // Port C bit 6 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PCIACK6_M \
                                0x00400000
#define GPIO_IRQ_DETECT_ACK_PCIACK6_S 22
#define GPIO_IRQ_DETECT_ACK_PCIACK5 \
                                0x00200000  // Port C bit 5 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PCIACK5_M \
                                0x00200000
#define GPIO_IRQ_DETECT_ACK_PCIACK5_S 21
#define GPIO_IRQ_DETECT_ACK_PCIACK4 \
                                0x00100000  // Port C bit 4 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PCIACK4_M \
                                0x00100000
#define GPIO_IRQ_DETECT_ACK_PCIACK4_S 20
#define GPIO_IRQ_DETECT_ACK_PCIACK3 \
                                0x00080000  // Port C bit 3 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PCIACK3_M \
                                0x00080000
#define GPIO_IRQ_DETECT_ACK_PCIACK3_S 19
#define GPIO_IRQ_DETECT_ACK_PCIACK2 \
                                0x00040000  // Port C bit 2 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PCIACK2_M \
                                0x00040000
#define GPIO_IRQ_DETECT_ACK_PCIACK2_S 18
#define GPIO_IRQ_DETECT_ACK_PCIACK1 \
                                0x00020000  // Port C bit 1 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PCIACK1_M \
                                0x00020000
#define GPIO_IRQ_DETECT_ACK_PCIACK1_S 17
#define GPIO_IRQ_DETECT_ACK_PCIACK0 \
                                0x00010000  // Port C bit 0 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PCIACK0_M \
                                0x00010000
#define GPIO_IRQ_DETECT_ACK_PCIACK0_S 16
#define GPIO_IRQ_DETECT_ACK_PBIACK7 \
                                0x00008000  // Port B bit 7 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

