RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_gpio.h
#define GPIO_IRQ_DETECT_ACK_PBIACK7_M \
                                0x00008000
#define GPIO_IRQ_DETECT_ACK_PBIACK7_S 15
#define GPIO_IRQ_DETECT_ACK_PBIACK6 \
                                0x00004000  // Port B bit 6 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PBIACK6_M \
                                0x00004000
#define GPIO_IRQ_DETECT_ACK_PBIACK6_S 14
#define GPIO_IRQ_DETECT_ACK_PBIACK5 \
                                0x00002000  // Port B bit 5 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PBIACK5_M \
                                0x00002000
#define GPIO_IRQ_DETECT_ACK_PBIACK5_S 13
#define GPIO_IRQ_DETECT_ACK_PBIACK4 \
                                0x00001000  // Port B bit 4 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PBIACK4_M \
                                0x00001000
#define GPIO_IRQ_DETECT_ACK_PBIACK4_S 12
#define GPIO_IRQ_DETECT_ACK_PBIACK3 \
                                0x00000800  // Port B bit 3 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PBIACK3_M \
                                0x00000800
#define GPIO_IRQ_DETECT_ACK_PBIACK3_S 11
#define GPIO_IRQ_DETECT_ACK_PBIACK2 \
                                0x00000400  // Port B bit 2 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PBIACK2_M \
                                0x00000400
#define GPIO_IRQ_DETECT_ACK_PBIACK2_S 10
#define GPIO_IRQ_DETECT_ACK_PBIACK1 \
                                0x00000200  // Port B bit 1 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PBIACK1_M \
                                0x00000200
#define GPIO_IRQ_DETECT_ACK_PBIACK1_S 9
#define GPIO_IRQ_DETECT_ACK_PBIACK0 \
                                0x00000100  // Port B bit 0 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PBIACK0_M \
                                0x00000100
#define GPIO_IRQ_DETECT_ACK_PBIACK0_S 8
#define GPIO_IRQ_DETECT_ACK_PAIACK7 \
                                0x00000080  // Port A bit 7 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PAIACK7_M \
                                0x00000080
#define GPIO_IRQ_DETECT_ACK_PAIACK7_S 7
#define GPIO_IRQ_DETECT_ACK_PAIACK6 \
                                0x00000040  // Port A bit 6 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PAIACK6_M \
                                0x00000040
#define GPIO_IRQ_DETECT_ACK_PAIACK6_S 6
#define GPIO_IRQ_DETECT_ACK_PAIACK5 \
                                0x00000020  // Port A bit 5 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PAIACK5_M \
                                0x00000020
#define GPIO_IRQ_DETECT_ACK_PAIACK5_S 5
#define GPIO_IRQ_DETECT_ACK_PAIACK4 \
                                0x00000010  // Port A bit 4 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PAIACK4_M \
                                0x00000010
#define GPIO_IRQ_DETECT_ACK_PAIACK4_S 4
#define GPIO_IRQ_DETECT_ACK_PAIACK3 \
                                0x00000008  // Port A bit 3 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PAIACK3_M \
                                0x00000008
#define GPIO_IRQ_DETECT_ACK_PAIACK3_S 3
#define GPIO_IRQ_DETECT_ACK_PAIACK2 \
                                0x00000004  // Port A bit 2 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PAIACK2_M \
                                0x00000004
#define GPIO_IRQ_DETECT_ACK_PAIACK2_S 2
#define GPIO_IRQ_DETECT_ACK_PAIACK1 \
                                0x00000002  // Port A bit 1 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PAIACK1_M \
                                0x00000002
#define GPIO_IRQ_DETECT_ACK_PAIACK1_S 1
#define GPIO_IRQ_DETECT_ACK_PAIACK0 \
                                0x00000001  // Port A bit 0 masked interrupt 
                                            // status: 1: Detected 0: Not 
                                            // detected 

#define GPIO_IRQ_DETECT_ACK_PAIACK0_M \
                                0x00000001
#define GPIO_IRQ_DETECT_ACK_PAIACK0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPIO_O_USB_IRQ_ACK register.
//
//*****************************************************************************
#define GPIO_USB_IRQ_ACK_USBACK 0x00000001  // USB masked interrupt status: 1: 
                                            // Detected 0: Not detected 
#define GPIO_USB_IRQ_ACK_USBACK_M \
                                0x00000001
#define GPIO_USB_IRQ_ACK_USBACK_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPIO_O_IRQ_DETECT_UNMASK register.
//
//*****************************************************************************
#define GPIO_IRQ_DETECT_UNMASK_PDIACK7 \
                                0x80000000  // Port D bit 7 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

