RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_gpio.h
#define GPIO_IRQ_DETECT_UNMASK_PDIACK7_M \
                                0x80000000
#define GPIO_IRQ_DETECT_UNMASK_PDIACK7_S 31
#define GPIO_IRQ_DETECT_UNMASK_PDIACK6 \
                                0x40000000  // Port D bit 6 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PDIACK6_M \
                                0x40000000
#define GPIO_IRQ_DETECT_UNMASK_PDIACK6_S 30
#define GPIO_IRQ_DETECT_UNMASK_PDIACK5 \
                                0x20000000  // Port D bit 5 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PDIACK5_M \
                                0x20000000
#define GPIO_IRQ_DETECT_UNMASK_PDIACK5_S 29
#define GPIO_IRQ_DETECT_UNMASK_PDIACK4 \
                                0x10000000  // Port D bit 4 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PDIACK4_M \
                                0x10000000
#define GPIO_IRQ_DETECT_UNMASK_PDIACK4_S 28
#define GPIO_IRQ_DETECT_UNMASK_PDIACK3 \
                                0x08000000  // Port D bit 3 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PDIACK3_M \
                                0x08000000
#define GPIO_IRQ_DETECT_UNMASK_PDIACK3_S 27
#define GPIO_IRQ_DETECT_UNMASK_PDIACK2 \
                                0x04000000  // Port D bit 2 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PDIACK2_M \
                                0x04000000
#define GPIO_IRQ_DETECT_UNMASK_PDIACK2_S 26
#define GPIO_IRQ_DETECT_UNMASK_PDIACK1 \
                                0x02000000  // Port D bit 1 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PDIACK1_M \
                                0x02000000
#define GPIO_IRQ_DETECT_UNMASK_PDIACK1_S 25
#define GPIO_IRQ_DETECT_UNMASK_PDIACK0 \
                                0x01000000  // Port D bit 0 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PDIACK0_M \
                                0x01000000
#define GPIO_IRQ_DETECT_UNMASK_PDIACK0_S 24
#define GPIO_IRQ_DETECT_UNMASK_PCIACK7 \
                                0x00800000  // Port C bit 7 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PCIACK7_M \
                                0x00800000
#define GPIO_IRQ_DETECT_UNMASK_PCIACK7_S 23
#define GPIO_IRQ_DETECT_UNMASK_PCIACK6 \
                                0x00400000  // Port C bit 6 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PCIACK6_M \
                                0x00400000
#define GPIO_IRQ_DETECT_UNMASK_PCIACK6_S 22
#define GPIO_IRQ_DETECT_UNMASK_PCIACK5 \
                                0x00200000  // Port C bit 5 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PCIACK5_M \
                                0x00200000
#define GPIO_IRQ_DETECT_UNMASK_PCIACK5_S 21
#define GPIO_IRQ_DETECT_UNMASK_PCIACK4 \
                                0x00100000  // Port C bit 4 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PCIACK4_M \
                                0x00100000
#define GPIO_IRQ_DETECT_UNMASK_PCIACK4_S 20
#define GPIO_IRQ_DETECT_UNMASK_PCIACK3 \
                                0x00080000  // Port C bit 3 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PCIACK3_M \
                                0x00080000
#define GPIO_IRQ_DETECT_UNMASK_PCIACK3_S 19
#define GPIO_IRQ_DETECT_UNMASK_PCIACK2 \
                                0x00040000  // Port C bit 2 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PCIACK2_M \
                                0x00040000
#define GPIO_IRQ_DETECT_UNMASK_PCIACK2_S 18
#define GPIO_IRQ_DETECT_UNMASK_PCIACK1 \
                                0x00020000  // Port C bit 1 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PCIACK1_M \
                                0x00020000
#define GPIO_IRQ_DETECT_UNMASK_PCIACK1_S 17
#define GPIO_IRQ_DETECT_UNMASK_PCIACK0 \
                                0x00010000  // Port C bit 0 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PCIACK0_M \
                                0x00010000
#define GPIO_IRQ_DETECT_UNMASK_PCIACK0_S 16
#define GPIO_IRQ_DETECT_UNMASK_PBIACK7 \
                                0x00008000  // Port B bit 7 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PBIACK7_M \
                                0x00008000
#define GPIO_IRQ_DETECT_UNMASK_PBIACK7_S 15
#define GPIO_IRQ_DETECT_UNMASK_PBIACK6 \
                                0x00004000  // Port B bit 6 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PBIACK6_M \
                                0x00004000
#define GPIO_IRQ_DETECT_UNMASK_PBIACK6_S 14
#define GPIO_IRQ_DETECT_UNMASK_PBIACK5 \
                                0x00002000  // Port B bit 5 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PBIACK5_M \
                                0x00002000
#define GPIO_IRQ_DETECT_UNMASK_PBIACK5_S 13
#define GPIO_IRQ_DETECT_UNMASK_PBIACK4 \
                                0x00001000  // Port B bit 4 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PBIACK4_M \
                                0x00001000
#define GPIO_IRQ_DETECT_UNMASK_PBIACK4_S 12
#define GPIO_IRQ_DETECT_UNMASK_PBIACK3 \
                                0x00000800  // Port B bit 3 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PBIACK3_M \
                                0x00000800
#define GPIO_IRQ_DETECT_UNMASK_PBIACK3_S 11
#define GPIO_IRQ_DETECT_UNMASK_PBIACK2 \
                                0x00000400  // Port B bit 2 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PBIACK2_M \
                                0x00000400
#define GPIO_IRQ_DETECT_UNMASK_PBIACK2_S 10
#define GPIO_IRQ_DETECT_UNMASK_PBIACK1 \
                                0x00000200  // Port B bit 1 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PBIACK1_M \
                                0x00000200
#define GPIO_IRQ_DETECT_UNMASK_PBIACK1_S 9
#define GPIO_IRQ_DETECT_UNMASK_PBIACK0 \
                                0x00000100  // Port B bit 0 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PBIACK0_M \
                                0x00000100
#define GPIO_IRQ_DETECT_UNMASK_PBIACK0_S 8
#define GPIO_IRQ_DETECT_UNMASK_PAIACK7 \
                                0x00000080  // Port A bit 7 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

