RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_gpio.h
#define GPIO_IRQ_DETECT_UNMASK_PAIACK7_M \
                                0x00000080
#define GPIO_IRQ_DETECT_UNMASK_PAIACK7_S 7
#define GPIO_IRQ_DETECT_UNMASK_PAIACK6 \
                                0x00000040  // Port A bit 6 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PAIACK6_M \
                                0x00000040
#define GPIO_IRQ_DETECT_UNMASK_PAIACK6_S 6
#define GPIO_IRQ_DETECT_UNMASK_PAIACK5 \
                                0x00000020  // Port A bit 5 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PAIACK5_M \
                                0x00000020
#define GPIO_IRQ_DETECT_UNMASK_PAIACK5_S 5
#define GPIO_IRQ_DETECT_UNMASK_PAIACK4 \
                                0x00000010  // Port A bit 4 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PAIACK4_M \
                                0x00000010
#define GPIO_IRQ_DETECT_UNMASK_PAIACK4_S 4
#define GPIO_IRQ_DETECT_UNMASK_PAIACK3 \
                                0x00000008  // Port A bit 3 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PAIACK3_M \
                                0x00000008
#define GPIO_IRQ_DETECT_UNMASK_PAIACK3_S 3
#define GPIO_IRQ_DETECT_UNMASK_PAIACK2 \
                                0x00000004  // Port A bit 2 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PAIACK2_M \
                                0x00000004
#define GPIO_IRQ_DETECT_UNMASK_PAIACK2_S 2
#define GPIO_IRQ_DETECT_UNMASK_PAIACK1 \
                                0x00000002  // Port A bit 1 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PAIACK1_M \
                                0x00000002
#define GPIO_IRQ_DETECT_UNMASK_PAIACK1_S 1
#define GPIO_IRQ_DETECT_UNMASK_PAIACK0 \
                                0x00000001  // Port A bit 0 unmasked interrupt 
                                            // status: 1: Detected 0: 
                                            // Undetected 

#define GPIO_IRQ_DETECT_UNMASK_PAIACK0_M \
                                0x00000001
#define GPIO_IRQ_DETECT_UNMASK_PAIACK0_S 0


#endif // __HW_GPIO_H__

